[
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3",
    "name": "DS 3",
    "slug": "",
    "startYear": "2016",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      }
    ],
    "segment": "Small",
    "description": "Citroen refreshed the DS3 model in 2016, and, along with the facelift, it introduced its premium brand named DS Automobiles.When Citroen introduced the DS model in the '50s, it was the most successful car in history, with orders piling up at a considerable rate. Only the Tesla Model 3 exceeded the same number in the first 24 hours since its launch. Just remember that there was no Internet nor live streaming in the '50s. Fast forward six decades, and the French carmaker considered that it was time to establish the DS Automobile as a distinct brand, and it started with this: the DS3.\n\nThe refreshed Citroen DS3 lost its Citroen badge but gained a new one. There were no \"double-chevron\" logos on the car—only the DS one, which took center stage on the front grille and the tailgate. To make the small-segment vehicle looks premium, it added a chromed trim around the grille. Its innovative LED-Xenon headlights were unique on the market when the car was introduced, and not only on the small segment. The car's profile remained the same, with a raked-forward B-pillar and a darkened C-pillar that created the illusion of a wrapped-around rear glass area.\n\nInside, DS Automobiles featured higher quality materials than in any regular Citroen. The DS3 sported a carbon-fiber look for the dashboard, leather-wrapped steering wheel, and handbrake. Its bucket seats were made more for comfort but with high bolstering areas. In the back, there was hardly room for three people, and even two were cramped. The rear seatback didn't fold flat, but it added some volume to the trunk.\n\nUnder the hood, the DS3 offered a choice of gasoline, and turbo-diesel engines ranged between 82 hp and 160 hp.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS3-2016_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds3-2016.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_4.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_5.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_6.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_8.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3",
    "name": "DS 3",
    "slug": "",
    "startYear": "2014",
    "endYear": "2016",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      }
    ],
    "segment": "Small",
    "description": "Citroen announced the launch of the premium brand DS in 2009 and in the next year it launched the Citroen DS3.In 2014 it dropped the Citroen nameplate and left only the DS.\n\nThe DS took its name from the glorious 1955 Citroen DS. The new generation started with the use of an existing platform, but with different bodyworks. Citroen DS3 was the first to break the ice and it became the best selling supermini premium car in Europe when it was introduced in 2010. In 2014 the DS3 was facelifted.\n\nOn the outside, the DS3 featured a combination of Xenon and LED headlights with sequential turn signals. For the night driving, both LED and Xenon was lit to create a wider, uniform, area. At the front, in the air-intakes, new signature LEDs for daytime running lights were installed. The taillights were LEDs as well and, when they were lit, the 3D light featured a chrome-finish DS logo in a black embossed DS setting.\n\nInside, the DS3 featured a five-seat configuration but due to the short wheelbase, the legroom was limited. The infotainment system was mounted on top of the center stack and contained the navigation and the stereo. The available reversing camera sent the image on the same screen.\n\nThe DS3 was considered a sporty hatchback and it was fitted with engines that could deliver some performance. It was the base car for the DS3 WRC, which competed in the World Rally Championship. Under the hood, the street version was fitted with a choice of diesel and gasoline units ranged between 100 hp and 207 hp. Depending on the engine, it was available with a 5- or 6-speed manual, a 4- or a 6-speed automatic.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS3-2014_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds3-2014.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_6.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_8.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_9.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_10.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 7",
    "name": "DS 7 Crossback",
    "slug": "",
    "startYear": "2017",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      },
      {
        "type": "Hybrid Gasoline"
      }
    ],
    "segment": "Medium SUV",
    "description": "DS is for Citroen like Lexus is for Toyota or Infinity for Lexus.A premium brand that evolved from a mass-market vehicle brand. And it grew with different vehicles.\n\nThe French tried to get a slice from the German Premium car-manufacturers with the DS brand and, for the SUV segment, it tried to do it with a 2WD cross-over. The DS7 had a special design, with a big 3D hexagonal grille. The angry headlights had LED fitted as standard and its three crystal-look LED lights had an angry look, like a pissed-off musketeer. From the side, it looked more like an SUV instead of a lifted station wagon, with a nice roof spoiler above the tailgate. \n\nThe interior design looked very different than most of the premium SUV vehicles on the market. The dashboard was covered in Alcantara, seats were bolstered and there were no dials inside the cabin. In front of the driver, there was a customizable TFT display and on top of the center console, it was the infotainment touch-screen display. It had some buttons for shortcuts to the HVAC, navigation, and sound system. In the back, there was seating for three adults and a nearly flat floor, that made it possible for the middle passenger to actually fit into place. \n\nThe technical platform was the same as for the Peugeot 3008 and Citroen C5 Aircross and featured the same engine and transmissions. The DS7 featured only front-wheel-drive versions and the only gearbox available was an 8-speed automatic.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS7-Crossback-2017_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds7-crossback-2017.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS7-Crossback-6007_5.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS7-Crossback-6007_6.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS7-Crossback-6007_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS7-Crossback-6007_8.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS7-Crossback-6007_9.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3 Crossback",
    "name": "DS 3 Crossback",
    "slug": "",
    "startYear": "2018",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      },
      {
        "type": "Electric"
      }
    ],
    "segment": "Crossover",
    "description": "The smallest crossover in the DS Automobiles range is built on Groupe PSA's newest architecture, called the \"Common Modular Platform\" (CMP), which was developed in cooperation with PSA's Chinese partners at DongFeng.Essentially the first of its kind, the DS 3 Crossback will spawn various Citroen, Opel and Dongfeng models, including the next generations of the Opel Corsa, the Peugeot 208 and the Citroen C4. In the DS lineup, the car will replace the DS 3.\n\nJust a little over four meters long, the first subcompact crossover from DS has a rather large engine lineup for a French premium car, especially since from mid 2019 it will also have a full-electric version. On the gasoline front there are three choices - with 100, 130 and 155 horsepower - while a diesel with 100 horsepower completes the internal combustion engine lineup. Called the DS 3 Crossback E-Tense, the electric version set to arrive later in the lineup is powered by a single electric motor with 136 horsepower and 260 Nm (191.8 lb-ft) of torque. Thanks to a 50 kWh lithium-ion battery situated under the floor, the car has a range of over 300 km (186 miles) with the WLTP cycle and about 450 km (280 miles) in the NEDC testing cycle.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/DS-AUTOMOBILES_DS-3-Crossback-2018_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/ds-automobiles-ds-3-crossback-2018.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-3-Crossback-6406_8.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-3-Crossback-6406_9.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-3-Crossback-6406_10.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-3-Crossback-6406_12.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-3-Crossback-6406_13.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 5",
    "name": "DS 5",
    "slug": "",
    "startYear": "2016",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      },
      {
        "type": "Hybrid Diesel"
      }
    ],
    "segment": "Compact",
    "description": "The 2016 DS5 was the Citroen's premium brand.It evolved from being a top of the line product to a separate car brand. The French car-maker tried to do with the DS what the Honda did with Acura.\n\nBefore the 2016 DS5 there was the 2012 Citroen DS5. It might be considered as a facelift with a new badge on the car since there were absolutely no Citroen badges on the vehicle. But that didn't say that the car was not built by Citroen. The DS5 was the flagship of the French car-maker and it tried to build it as good as it could, but with a price-tag limit on its mind.\n\nThe egg-shape of the vehicle was a hatchback but styled to not look just like a regular compact MPV. It featured a floating roof design, thanks to the enlarged and Z-shaped rear quarter panels. The headlights were long and integrated nicely into a front fascia that tried to become specific for the DS brand.\n\nInside, the cabin was arranged as a cockpit. There were buttons on the center console, on the right side of the steering wheel, on the dashboard, and even on the car's ceiling. It was imagined as an airplane cockpit. Just like the Citroen DS, a car design by aircraft engineers. Unlike most of the Citroen products, the DS5 was carefully crafted with big attention to details.\n\nThe drivetrain featured platforms taken from other cars from the PSA (Peugeot-Citroen) group. It was offered with a choice of turbocharged gasoline and diesel units. A special hybrid diesel-electric was available, with an all-wheel-drive system. A 6-speed transmission was fitted as standard.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/DS-AUTOMOBILES_DS-5-2016_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/ds-automobiles-ds-5-2016.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-5-6353_2.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-5-6353_3.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-5-6353_4.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-5-6353_5.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-5-6353_6.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 4",
    "name": "DS 4",
    "slug": "",
    "startYear": "2021",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      },
      {
        "type": "Hybrid Gasoline"
      }
    ],
    "segment": "Compact",
    "description": "In February 2021, DS Automobiles introduced the second generation of its compact crossover contender, the DS 4.Back in the '50s and '60s, Citroen was considered a premium brand, and the phenomenal DS model was iconic for the French brand. Over time, Citroen's aura started to fade, and it became just a shadow of the glorious brand it used to be. But that was changed in 2015 when the company's management decided to restore its golden age and introduced the DS Automobile as a premium brand for Citroen. The new brand evolved from Citroen as a premium carmaker in the same way that Infiniti grew from Nissan, Lexus from Toyota, or Acura from Honda.\n\nThe DS4 was a creative mix between a compact and a crossover vehicle. By 2021, its three LED headlamps were already a lighting signature for the French carmaker. Its broad grille extended from the hood to the bottom of the apron, filling the space between the headlights, was a bold statement for the French carmaker. The sloped C-pillars enhanced the car's sporty look in a way that only the glorious Citroen SM dared to be.\n\nInside, the French designers imagined a cabin with an exclusive look and high-quality materials. They mixed the refinement and the technology in a way that few carmakers could ever do. The leather-wrapped dashboard featured a center-mounted infotainment touch-screen and another TFT display in the instrument cluster.\n\nBased on the EMP2 platform, the DS4 shared its underpinning with other Citroen and Peugeot products. It featured a wide range of diesel, gasoline, and plug-in hybrid powertrains.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/DS-AUTOMOBILES_DS-4-2021_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/ds-automobiles-ds-4-2021.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/ds-automobiles-ds-4-2021-7008_2.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/ds-automobiles-ds-4-2021-7008_3.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/ds-automobiles-ds-4-2021-7008_4.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/ds-automobiles-ds-4-2021-7008_5.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/ds-automobiles-ds-4-2021-7008_6.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 9",
    "name": "DS 9",
    "slug": "",
    "startYear": "2020",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Hybrid"
      }
    ],
    "segment": "Medium Premium",
    "description": "The DS brand has evolved from the French Citroen brand into a different company, with specially designed vehicles.DS cars aren't just rebadged and refurbished Citroen models, but they still use the same technical platforms, with a completely different look and image.\n\nDS' latest product should have been shown at the 2020 Geneva Motor Show. Unfortunately, the show was canceled but the vehicle will be available soon in dedicated DS showrooms. It is based on the same EMP2 platform as the Peugeot 508. Some design features might be similar from one to the other but the luxurious interior of the DS9 is unique.\n\nThe DS9 will be offered with the new E-TENSE plug-in hybrid powertrain. It comprises a turbocharged gasoline engine and an electric motor. The total output is 225hp and is able to drive 40-50 km (25-31 miles) in electric mode. The battery pack has 11.9 kWh. The electric motor has 110 hp and 320 Nm (236 lb.-ft) of torque and drives the wheels via an 8-speed automatic gearbox. Soon there are going to be other powertrain options as well, including an all-wheel-drive hybrid version with a 360 hp combined output.\n\nInside the 4.93m (16.2 ft) long sedan there is room for five, with enough legroom for the rear passengers thanks to the 2.90 m (9.5 ft) wheelbase. The infotainment unit allows Apple CarPlay and Android Auto connection.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/DS-AUTOMOBILES_DS-9-2020_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/ds-automobiles-ds-9-2020.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-9-6756_5.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-9-6756_6.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-9-6756_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-9-6756_8.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/DS-AUTOMOBILES-DS-9-6756_9.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3 Cabrio",
    "name": "DS 3 Cabrio",
    "slug": "",
    "startYear": "2016",
    "endYear": "2018",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      }
    ],
    "segment": "Small",
    "description": "Citroen unveiled the facelifted version of the DS 3 in 2016, along with the release of the DS premium brand.The French carmaker introduced the DS 3 in 2009 as an exclusive range in the Citroen stable but, by 2016, it decided that along with the facelifted version, to release it as a separate brand known as DS. Honda, Toyota, and Nissan did the same with Acura, Lexus, and Infiniti, respectively. So while the 2016 DS 3 still relied on the same technical platform as the Citroen C3 and the Peugeot 208, it featured a different styling, available exclusively as a 3-door hatchback or a convertible.\n\nOn the 2016 model, the DS3 Cabriolet featured a new front fascia with a unique-shaped grille surrounded by a chromed trim. Its front bumper sported the LED daytime running lights incorporated vertically into side scoops. But the carmaker chose the light way of creating an open-top vehicle and installed a retractable roof and rear windscreen only. Its doors and rear side windows remained in place.\n\nInside, the interior offered a premium feeling with high-quality materials adorned by aluminum and piano-black trims. Its front high-bolstered bucket seats at the front provided good side support for their occupants during high-speed cornering, while at the back, there was room for two passengers on the 60/40 split-folding rear seatback.\n\nUnder the hood, DS installed Euro 6 engines, both gasoline, and turbo-diesel. Power ranged between 82 hp for the naturally aspirated 1.2-liter gasoline unit and 208 hp for the 1.6-liter turbocharged gasoline four-pot. Two turbo-diesel versions were available as well.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS3-Cabrio-2016_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds3-cabrio-2016.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-5575_1.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-5575_2.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-5575_3.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-5575_4.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-5575_5.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3 Cabrio",
    "name": "DS 3 Cabrio",
    "slug": "",
    "startYear": "2013",
    "endYear": "2016",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      }
    ],
    "segment": "Small",
    "description": "Citroen officially unveiled the first convertible DS model in 2012 at the Paris Motor Show.Called the DS3 Cabrio, this has the same basic shape as the coupe, thanks to a long fabric tarp that rolls back from the windshield all the way to the back, similar to the design of the Fiat 500C. Depending on the trim level, the DS3 Cabrio can be a pretty luxurious car, with plenty of leather trim and body color choices. If you want a sporty yet elegant French convertible that's great around town, look no further than this car. Just don't expect to get a lot into the tiny boot space.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS3-Cabrio-2013_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds3-cabrio-2013.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-4928_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-4928_10.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-4928_13.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-4928_15.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-Cabrio-4928_17.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 5LS",
    "name": "DS 5LS",
    "slug": "",
    "startYear": "2014",
    "endYear": "2018",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      },
      {
        "type": "Hybrid Diesel"
      }
    ],
    "segment": "Medium Premium",
    "description": "On December 19th, 2013, Citroen pulled the wraps off its first premium class sedan specifically designed for the Chinese market.In the face of diminishing European sales, the French carmaker is aggressively targeting the fast-growing market there and thus designed a long wheelbase sedan with good equipment levels and imposing styling, thus tailored to local demand. Styled similarly to the Wild Rubis concept, the 5LS sedan brings about a new design language for production Citroen. From launch, this car will be available with a choice of two outputs from the same 1.6-liter THP turbo, 160 hp for the cheaper models or 200 hp for more performance.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS-5lS-2014_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds-5ls-2014.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS-5lS-5079_1.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS-5lS-5079_2.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS-5lS-5079_3.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS-5lS-5079_4.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS-5lS-5079_5.jpg"
    ]
  }
]