[
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3",
    "name": "DS 3",
    "slug": "",
    "startYear": "2016",
    "endYear": "Present",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      }
    ],
    "segment": "Small",
    "description": "Citroen refreshed the DS3 model in 2016, and, along with the facelift, it introduced its premium brand named DS Automobiles.When Citroen introduced the DS model in the '50s, it was the most successful car in history, with orders piling up at a considerable rate. Only the Tesla Model 3 exceeded the same number in the first 24 hours since its launch. Just remember that there was no Internet nor live streaming in the '50s. Fast forward six decades, and the French carmaker considered that it was time to establish the DS Automobile as a distinct brand, and it started with this: the DS3.\n\nThe refreshed Citroen DS3 lost its Citroen badge but gained a new one. There were no \"double-chevron\" logos on the car—only the DS one, which took center stage on the front grille and the tailgate. To make the small-segment vehicle looks premium, it added a chromed trim around the grille. Its innovative LED-Xenon headlights were unique on the market when the car was introduced, and not only on the small segment. The car's profile remained the same, with a raked-forward B-pillar and a darkened C-pillar that created the illusion of a wrapped-around rear glass area.\n\nInside, DS Automobiles featured higher quality materials than in any regular Citroen. The DS3 sported a carbon-fiber look for the dashboard, leather-wrapped steering wheel, and handbrake. Its bucket seats were made more for comfort but with high bolstering areas. In the back, there was hardly room for three people, and even two were cramped. The rear seatback didn't fold flat, but it added some volume to the trunk.\n\nUnder the hood, the DS3 offered a choice of gasoline, and turbo-diesel engines ranged between 82 hp and 160 hp.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS3-2016_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds3-2016.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_4.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_5.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_6.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5574_8.jpg"
    ]
  },
  {
    "brand": "DS AUTOMOBILES",
    "series": "DS 3",
    "name": "DS 3",
    "slug": "",
    "startYear": "2014",
    "endYear": "2016",
    "fuelType": [
      {
        "type": "Gasoline"
      },
      {
        "type": "Diesel"
      }
    ],
    "segment": "Small",
    "description": "Citroen announced the launch of the premium brand DS in 2009 and in the next year it launched the Citroen DS3.In 2014 it dropped the Citroen nameplate and left only the DS.\n\nThe DS took its name from the glorious 1955 Citroen DS. The new generation started with the use of an existing platform, but with different bodyworks. Citroen DS3 was the first to break the ice and it became the best selling supermini premium car in Europe when it was introduced in 2010. In 2014 the DS3 was facelifted.\n\nOn the outside, the DS3 featured a combination of Xenon and LED headlights with sequential turn signals. For the night driving, both LED and Xenon was lit to create a wider, uniform, area. At the front, in the air-intakes, new signature LEDs for daytime running lights were installed. The taillights were LEDs as well and, when they were lit, the 3D light featured a chrome-finish DS logo in a black embossed DS setting.\n\nInside, the DS3 featured a five-seat configuration but due to the short wheelbase, the legroom was limited. The infotainment system was mounted on top of the center stack and contained the navigation and the stereo. The available reversing camera sent the image on the same screen.\n\nThe DS3 was considered a sporty hatchback and it was fitted with engines that could deliver some performance. It was the base car for the DS3 WRC, which competed in the World Rally Championship. Under the hood, the street version was fitted with a choice of diesel and gasoline units ranged between 100 hp and 207 hp. Depending on the engine, it was available with a 5- or 6-speed manual, a 4- or a 6-speed automatic.",
    "image_url": "https://s1.cdn.autoevolution.com/images/models/CITROEN_DS3-2014_main.jpg",
    "detail_url": "https://www.autoevolution.com/cars/citroen-ds3-2014.html",
    "images_url": [
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_6.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_7.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_8.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_9.jpg",
      "https://s1.cdn.autoevolution.com/images/gallery/CITROEN-DS3-5205_10.jpg"
    ]
  }
]